document.addEventListener('DOMContentLoaded', () => {
  const type = document.body.dataset.emojis;

  // Наборы эмоджи по типу
  const emojiSets = {
    love: ['💖', '👼', '🥰', '💕', '❤️', '🌺', '👼🏿', '😍', '💓', '💞', '☺️','💋','вечером свободна?','утром свободна?','днем свободна?','приветик красотка😍😍'],
    confirm: ['🌸', '🌺', '🌹', '🌷', '🌼', '💐', '🌻', '🍀','ураааа','15 рублей не забудь взять','кто опоздает тот лох','наконец то!!'],
    cute: ['💋', 'я влюбился по уши потеряв память', '🔥', '😍', '😘', 'эйфория это и есть как мы', '❤️', 'ты будешь моей...' , 'учитывай что я на тебе помешался','ты сводишь с ума меня','будто самый лучший сон мой','я по тебе скучаю ','я хочу очень тебя обнять',],
    parking:['аптеки столички??','город грез и несбывшихся надежд','останься со мной...', '🍄','🌲','🐿️','🌳','🦔','🌿','☀️','🐇','мед для ушей и глаз🥰🥰'],
    parking_SP:['13-14 сентября...','52','дождливо как в Питере','🌳','🐿️','🌲','🍄','☀️','я знаю что ты дома','здесь замирает время','когда будет дождь мы весело станцуем'],
    time: ['🗓️', '⏰', '🕒', '📅', '🕘', '📆', '💖', '❣️', 'когда тебе удобно?', 'выбирай 🕒'],
    sad:['😢', '😭', '😞', '😔', '💔', '🥺', '😩', '🙁', '💧','💦','жизнь боль...','депресия в 0 лет...','почему(why)...','за окном rain...','на душе pain...',],
    choise: [
    '🌸', '🍃', '👼',  '✨', '😍', '👼', 
    '😳', '🫶', '🍭',  '🍷',  '🤍', '✨',
    '🎉', '🫠',  '💫', '⭐', '🌈', '🎁', 'поход в горы???','ты такая красивая...','челябинск???','тверь???','место встречи...','москоуу???','питеррр???'],
    choise_moscow: [
    '🌸', '🟥', '👼',  '✨', '😍', '👼', 
    '😳', '🌆', '🏙️',  '🍷',  '🤍', '✨',
    '🎉', '⛪',  '💫', '⭐', '🌈', '🎁', 'ты безупречней всех...','ты такая красивая...','мне всё равно где ты я заберу тебя в москву','у меня есть желание зай','нам по пути'],
    choise_SP: [
    '🌸', '🌉', '👼',  '✨', '😍', '👼', 
    '🚢', '🫶', '🏰',  '🍷',  '🤍', '✨',
    '🎨 ', '🚆',  '💫', '⭐', '❣️', '🌊', '52','ты такая красивая...','ты святая как питер','я торчу на тебе','в питере душа','в питере ❤️','да здравствует петербург'],
    builder: ['💖', '👷‍♂️', '🛠️', '🤔', '❤️', '🔨', '👼🏿', '🎯', '💥', '💞', '☺️','🔫','конденсатик...','','с днем строителя!!','я стреляю', "💥 выстрелить сердцами"],
  };

  const emojis = emojiSets[type] || emojiSets.hearts; // fallback на hearts

  // Создание контейнера
  const heartsContainer = document.createElement('div');
  heartsContainer.classList.add('hearts-container');
  document.body.appendChild(heartsContainer);

  // Падающий эмоджи
  function createEmoji() {
    const emoji = document.createElement('div');
    emoji.classList.add('falling-emoji');
    emoji.innerText = emojis[Math.floor(Math.random() * emojis.length)];
    emoji.style.left = Math.random() * 100 + 'vw';
    emoji.style.animationDuration = (4 + Math.random() * 3) + 's';
    emoji.style.fontSize = (20 + Math.random() * 20) + 'px';
    emoji.style.top = '-50px';
    heartsContainer.appendChild(emoji);
    setTimeout(() => emoji.remove(), 5000);
    
  }

  setInterval(createEmoji, 300);
});
