document.addEventListener('DOMContentLoaded', () => {
  const type = document.body.dataset.emojis;

  // Наборы эмоджи по типу
  const emojiSets = {
    concert: ['🎤', '🎶', '🎧', '🎸', '🥁', '🎹', '🎷', '🎼', '💃', '🕺','😎','🔥',],
    love: ['💖', '👼', '🥰', '💕', '❤️', '🌺', '👼🏿', '😍', '💓', '💞', '☺️','💋','вечером свободна?','утром свободна?','днем свободна?'],
    flowers: ['🌸', '🌺', '🌹', '🌷', '🌼', '💐', '🌻', '🌿','не опаздывай','50 рублей не забудь взять','кто опоздает тот лох','привет как дела?'],
    egor: ['💋', '😎', '🔥', '😍', '😘', '👑', '🖤', '💄', '🕶️', '🤳'],
    parking:['Грибочкииии','Лисичкиии','Поганки((','🍄','🌲','🐿️','🌳','🦔','🌿','☀️','🐇','мухомооор'],
    time: ['🗓️', '⏰', '🕒', '📅', '🕘', '📆', '💖', '❣️', 'когда тебе удобно?', 'выбирай 🕒'],
    sad:['😢', '😭', '😞', '😔', '💔', '🥺', '😩', '🙁', '💧','💦','жизнь боль...','депресия в 0 лет...','почему(why)...','за окном rain...','на душе pain...',],
    choise: [
    '🌸', '🍃', '🍄', '🐿️', '🦆', '🎼',
    '🍔', '🍟', '🍭',  '🎂', '🎤', '💃', '🎧', '🎀', '✨',
    '🎉', '🎈',  '💫', '⭐', '🌈', '🎁', 'Парки???','гулять??','мак???','культурный отдых???','лужники 31 августа???','Егор Крид выбрал бы тебя...']
  };

  const emojis = emojiSets[type] || emojiSets.hearts; // fallback на hearts

  // Создание контейнера
  const heartsContainer = document.createElement('div');
  heartsContainer.classList.add('hearts-container');
  document.body.appendChild(heartsContainer);

  // Падающий эмоджи
  function createEmoji() {
    const emoji = document.createElement('div');
    emoji.classList.add('falling-emoji');
    emoji.innerText = emojis[Math.floor(Math.random() * emojis.length)];
    emoji.style.left = Math.random() * 100 + 'vw';
    emoji.style.animationDuration = (2 + Math.random() * 3) + 's';
    emoji.style.fontSize = (20 + Math.random() * 30) + 'px';
    emoji.style.top = '-50px';
    heartsContainer.appendChild(emoji);
    setTimeout(() => emoji.remove(), 5000);
  }

  setInterval(createEmoji, 300);
});
